Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Make shadow calculation to use a larger or smaller rectangle as base.
it_it: Esegue il calcolo dell'ombra per utilizzare un rettangolo più grande o più piccolo come base.

source: Make sure :c:macro:`LV_VG_LITE_USE_GPU_INIT` is enabled, because the thorvg drawing context needs to be initialized before it can be used.
it_it: Assicurarsi che :c:macro:`LV_VG_LITE_USE_GPU_INIT` sia abilitato, perché il contesto di disegno thorvg deve essere inizializzato prima di poter essere utilizzato.

source: Make sure that both channels of ``SW1`` DIP switch (next to ``ECN1``) are OFF.
it_it: Assicurarsi che entrambi i canali del DIP switch ``SW1`` (accanto a ``ECN1``) siano OFF.

source: Make sure that the string passed in by :c:macro:`LV_PROFILER_BEGIN_TAG` or :c:macro:`LV_PROFILER_END_TAG` is not a local variable on the stack or a string in shared memory, because currently only the string address is recorded and the content is not copied.
it_it: Assicurarsi che la stringa passata da :c:macro:`LV_PROFILER_BEGIN_TAG` o :c:macro:`LV_PROFILER_END_TAG` non sia una variabile locale nello stack o una stringa nella memoria condivisa, poiché attualmente viene registrato solo l'indirizzo della stringa e il contenuto non viene copiato.

source: Make sure that your hardware has been adapted to the VG-Lite API and that the absolute path to ``vg_lite.h``, which can be directly referenced by lvgl, has been exposed.
it_it: Assicurarsi che l'hardware sia stato adattato all'API VG-Lite e che sia stato esposto il path assoluto a ``vg_lite.h``, a cui lvgl può fare riferimento direttamente.

source: Make sure the heap is large enough, as a buffer with the same size as the partial buffer will be allocated.
it_it: Assicurarsi che l'heap sia sufficientemente grande, poiché verrà allocato un buffer con le stesse dimensioni del buffer parziale.

source: Make sure these are installed in your environment.
it_it: Assicurarsi che siano installati nel proprio ambiente.

source: Make sure to compile the ``.c`` file of your font.
it_it: Assicurarsi di compilare il file ``.c`` del proprio font.

source: Make this file executable.
it_it: Rendere questo file eseguibile.

source: Manage audio volume with built-in controls:
it_it: Il volume audio si gestisce con i controlli integrati:

source: Managed builds
it_it: Build gestite

source: Management of the life any value arrays you provide is up to you.
it_it: La gestione della durata di vita di tutti gli array di valori forniti è a discrezione dell'utente.

source: Manually Creating an Image
it_it: Creare Manualmente un'Immagine

source: Manually Using an Image Decoder
it_it: Utilizzo Manuale di un Decoder di Immagini

source: Manually call or use a timer to call the :cpp:func:`lv_profiler_builtin_flush` function to force the log to be flushed.
it_it: Chiamare manualmente o utilizzare un timer per chiamare la funzione :cpp:func:`lv_profiler_builtin_flush` per forzare lo svuotamento del log.

source: Many :ref:`LVGL examples <examples>` are available also for MicroPython.
it_it: Molti :ref:`esempi LVGL <examples>` sono disponibili anche per MicroPython.

source: Many STM32s come with a dedicated hardware peripheral for accelerating pixel data manipulation.
it_it: Molti STM32 sono dotati di una periferica hardware dedicata per accelerare la manipolazione dei pixel.

source: Many of their chips have two asymmetrical cores.
it_it: Molti dei loro chip hanno due core asimmetrici.

source: Many platforms are supported.
it_it: Sono supportate numerose piattaforme.

source: Many platforms have built-in functions that can be used as they are.
it_it: Molte piattaforme dispongono di funzioni native utilizzabili così come sono.

source: Many ready-to-use projects are available to get started easily on Windows, Linux, macOS, and in a web browser.
it_it: Sono disponibili molti progetti pronti all'uso per iniziare facilmente su Windows, Linux, macOS e tramite browser web.

source: Mapping
it_it: Mappatura

source: Masking Operation
it_it: Operazione di Mascheramento

source: Max text length
it_it: Lunghezza massima del testo

source: Maximized mode
it_it: Modalità massimizzata

source: Means ``LV_SIZE_CONTENT``.
it_it: Significa ``LV_SIZE_CONTENT``.

source: Means some time in milliseconds unit
it_it: Indica un intervallo di tempo in millisecondi.

source: Meanwhile 3rd party libraries (like :ref:`LodePNG<lodepng_rst>` and :ref:`Tiny JPEG<tjpgd>`) allow using image files without conversion.
it_it: Mentre librerie di terze parti (come :ref:`LodePNG<lodepng_rst>` e :ref:`Tiny JPEG<tjpgd>`) consentono di utilizzare file immagine senza conversione.

source: Measure flush operations
it_it: Misurazione delle operazioni di flush

source: Measurement
it_it: Misurazione

source: Measuring Idle Time
it_it: Misurazione del Tempo di Inattività

source: Media Information Access
it_it: Accesso alle Informazioni sui Media

source: Media Source Configuration
it_it: Configurazione della Sorgente Multimediale

source: Media duration via ``lv_gstreamer_get_duration()``
it_it: Durata del contenuto multimediale tramite ``lv_gstreamer_get_duration()``

source: Members of the RA family require certain versions of the Flexible Software Package (FSP).
it_it: I membri della famiglia RA richiedono determinate versioni del Flexible Software Package (FSP).

source: Memory
it_it: Memoria

source: Memory Considerations
it_it: Considerazioni sulla Memoria

source: Memory Limit for Layers
it_it: Limite di Memoria per i Layer

source: Memory Management
it_it: Gestione della Memoria

source: Memory Monitor
it_it: Monitor della Memoria Memory

source: Memory Requirements
it_it: Requisiti di Memoria

source: Memory Usage
it_it: Utilizzo della Memoria

source: Memory requirements for WebP images:
it_it: Requisiti di memoria per le immagini WebP:

source: Memory: ``mem_update_timer_cb``
it_it: Memoria: ``mem_update_timer_cb``

source: Menu
it_it: Menù

source: Merge cells
it_it: Unione delle celle

source: Merging new code into the ``lvgl/lvgl`` and other repositories happens via *Pull Requests* (PR for short).
it_it: Il merging di nuovo codice in ``lvgl/lvgl`` e in altri repository avviene tramite *Pull Request* (in breve PR).

source: Message Box
it_it: Casella Messaggi

source: Message box with blurred background
it_it: Message box con background sfocato

source: Message boxes act as pop-ups.
it_it: I "Message box" [finestre di messaggio] fungono da pop-up.

source: Metallic knob with conic gradient
it_it: Manopola metallica con gradiente conico

source: MicroPython + LVGL could be used for:
it_it: MicroPython + LVGL potrebbe essere utilizzato per:

source: MicroPython `does not have a good native high-level GUI library <https://forum.micropython.org/viewtopic.php?f=18&t=5543>`__.
it_it: MicroPython `non dispone di una buona libreria GUI nativa di alto livello <https://forum.micropython.org/viewtopic.php?f=18&t=5543>`__.

source: MicroPython is ported to many platforms.
it_it: MicroPython è disponibile su numerose piattaforme.

source: Mid- and large-scale issues are discussed in `Feature Planning <https://github.com/lvgl/lvgl/issues/new?assignees=&labels=&projects=&template=feat-planning.yml>`__ issues.
it_it: Le problematiche di media e larga scala vengono discusse nelle problematiche della `Feature Planning <https://github.com/lvgl/lvgl/issues/new?assignees=&labels=&projects=&template=feat-planning.yml>`__.

source: Min and Max Size
it_it: Dimensioni Minime e Massime

source: Minified versions of the XML files in the ``files/`` directory in this example will be put in the blob.
it_it: Le versioni minificate dei file XML nella directory ``files/`` in questo esempio verranno inserite nel blob.

source: Minimize window
it_it: Ridurre a icona la finestra

source: Minimum and maximum values
it_it: Valori minimi e massimi

source: Minor releases: every 3-4 months
it_it: Release minor: ogni 3-4 mesi

source: Minor version: new but backward-compatible functionalities.
it_it: Versione minor: funzionalità nuove ma retrocompatibili.

source: Mirroring a Display
it_it: Mirroring di un Display

source: Miscellaneous
it_it: Varie

source: Missing the step while setting up the project will cause a compilation error.
it_it: Omettere questo passaggio durante la configurazione del progetto causerà un errore di compilazione.

source: Mix a color with all colors of the Widget.
it_it: Mescola un colore con tutti i colori del Widget.

source: Mixed properties for various purposes.
it_it: Proprietà miste per vari scopi.

source: Mixes this color with the image.
it_it: Mescola questo colore con l'immagine.

source: Mixing the two could result in unintended behavior.
it_it: Combinarli potrebbe causare comportamenti indesiderati.

source: Mode
it_it: Modalità

source: Mode Information API
it_it: API Informazioni Modalità

source: Model Inspection
it_it: Ispezione del Modello

source: Modelling a GUI in a more abstract way by defining reusable composite Widgets, taking advantage of Python's language features such as Inheritance, Closures, List Comprehension, Generators, Exception Handling, Arbitrary Precision Integers and others.
it_it: Modellare una GUI in modo più astratto definendo widget compositi riutilizzabili, sfruttando le funzionalità del linguaggio Python come ereditarietà, chiusure, comprensione di liste, generatori, gestione delle eccezioni, interi a precisione arbitraria e altre.

source: Modelling the GUI in a more abstract way by defining reusable composite Widgets, taking advantage of Berry's language features such as Inheritance, Closures, Exception Handling…
it_it: Modellare la GUI in modo più astratto definendo widget compositi riutilizzabili, sfruttando le funzionalità del linguaggio Berry come Ereditarietà, Chiusure, Gestione delle Eccezioni...

source: Moderate Performance: Dynamic content with predictable patterns still sees improvements
it_it: Prestazioni Moderate: I contenuti dinamici con pattern prevedibili subiscono comunque miglioramenti.

source: Modes
it_it: Modalità

source: Modify ``build/conf/local.conf`` file adding this line
it_it: Modificare il file ``build/conf/local.conf`` aggiungendo questa riga.

source: Modify and mix colors
it_it: Modificare e mescolare i colori

source: Modify the draw descriptors
it_it: Modifica dei descrittori di disegno

source: Modify the project
it_it: Modificare il progetto

source: Modify value by 1 (with live update in preview)
it_it: Modifica il valore di 1 (con aggiornamento in tempo reale nell'anteprima)

source: Modify value by 10 (with live update in preview)
it_it: Modifica il valore di 10 (con aggiornamento in tempo reale nell'anteprima)

source: Modifying data
it_it: Modifica dei dati

source: Modifying the partition table
it_it: Modifica della tabella delle partizioni

source: Modular style update on theme change
it_it: Aggiornamento dello stile modulare al cambio del tema

source: Monitors with an HDMI port
it_it: Monitor con porta HDMI

source: Monkey Testing is a technique where the user tests the application or system by providing random inputs and checking the behavior or seeing whether the application or system will crash.
it_it: Il Monkey Testing è una tecnica in cui l'utente testa l'applicazione o il sistema fornendo input casuali e verificandone il comportamento o verificando se l'applicazione o il sistema si arresteranno in modo anomalo.

source: Monochrome Displays
it_it: Display Monocromatici

source: Monospace font
it_it: Carattere a spaziatura fissa

source: Month shown
it_it: Mese visualizzato

source: More Complex Expressions
it_it: Espressioni Più Complesse

source: More Info
it_it: Ulteriori Informazioni

source: More events can be added to a Widget, like this:
it_it: È possibile aggiungere altri eventi a un Widget, in questo modo:

source: More info can be found at the :ref:`driver's page<renesas_glcdc>`.
it_it: Maggiori informazioni sono disponibili nella :ref:`pagina dei driver<renesas_glcdc>`.

source: More information about PPA can be found in: :ref:`PPA (Pixel Processing Accelerator) Support <esp_ppa>`.
it_it: Ulteriori informazioni su PPA sono disponibili in: :ref:`Supporto per il PPA (Pixel Processing Accelerator) <esp_ppa>`.

source: More information is available on the Toradex `website <https://www.toradex.com/computer-on-modules>`_.
it_it: Ulteriori informazioni sono disponibili sul `sito web <https://www.toradex.com/computer-on-modules>`_ di Toradex.

source: More information is provided in the `Torizon documentation <https://www.torizon.
it_it: Ulteriori informazioni sono disponibili nella `documentazione di Torizon <https://www.torizon.

source: More information on the build environment for Torizon containers is available `here <https://developer.toradex.com/torizon/application-development/working-with-containers/configure-build-environment-for-torizon-containers/>`_.
it_it: Ulteriori informazioni sull'ambiente di build per i container Torizon sono disponibili `qui <https://developer.toradex.com/torizon/application-development/working-with-containers/configure-build-environment-for-torizon-containers/>`_.

source: More information on version specifications can be found in the `IDF Component Manager documentation <https://docs.espressif.com/projects/idf-component-manager/en/latest/reference/versioning.html#range-specifications>`__.
it_it: Ulteriori informazioni sulle specifiche di versione sono disponibili nella documentazione di `IDF Component Manager <https://docs.espressif.com/projects/idf-component-manager/en/latest/reference/versioning.html#range-specifications>`__.

source: More sophisticated methods can be also implemented, like queuing transfers and scheduling them in the background.
it_it: È possibile implementare anche metodi più sofisticati, come l'accodamento dei trasferimenti e la loro pianificazione in background.

source: More symbols can be enumerated with ``,``.
it_it: È possibile enumerare altri simboli con ``,`` [virgola].

source: More than one data series can be associated with each axis.
it_it: È possibile associare più serie di dati a ciascun asse.

source: Moreover, it can add support for touch, rotary encoders, button or USB HID inputs.
it_it: Inoltre, può aggiungere il supporto per touch, encoder rotativi, pulsanti o ingressi USB HID.

source: Most Autotools-based recipes support separating these directories.
it_it: La maggior parte delle ricette basate su Autotools supporta la separazione di queste directory.

source: Most boards or shields that have a display or display connector have the pointer input device already declared:
it_it: La maggior parte delle schede o degli shield dotati di display o connettore per display hanno il dispositivo di input del puntatore già dichiarato:

source: Most languages use a Left-to-Right (LTR for short) writing direction, however some languages (such as Hebrew, Persian or Arabic) use Right-to-Left (RTL for short) direction.
it_it: La maggior parte delle lingue utilizza la direzione di scrittura da sinistra a destra (LTR in breve), tuttavia alcune lingue (come l'ebraico, il persiano o l'arabo) utilizzano la direzione da destra a sinistra (RTL in breve).

source: Most of the porting-related work is focused on writing such a callback in an effective way.
it_it: La maggior parte del lavoro relativo al porting si concentra sulla scrittura di tale callback in modo efficace.

source: Most of these connections are done automatically (e.g., for styles, fonts, images, animations, gradients, etc.) when the components and ``globals.xml``\ s are registered.
it_it: La maggior parte di queste connessioni viene eseguita automaticamente (ad esempio, per stili, font, immagini, animazioni, gradienti, ecc.) quando vengono registrati i componenti e i ``globals.xml``.

source: Most screenshot and UI images (where there are a limited number of colors) can be compressed to save more than 70% space.
it_it: La maggior parte degli screenshot e delle immagini dell'interfaccia utente (con un numero limitato di colori) può essere compressa per risparmiare oltre il 70% di spazio.

source: Most-recently-used images are prioritized to keep in the cache as long as possible, while the oldest (images not used recently) are disposed of to make room for new cache content.
it_it: Le immagini utilizzate più di recente hanno la priorità per essere mantenute nella cache il più a lungo possibile, mentre quelle più vecchie (immagini non utilizzate di recente) vengono eliminate per fare spazio al nuovo contenuto della cache.

source: Mouse/touch controls for camera rotation
it_it: Controlli mouse/touch per la rotazione della telecamera

source: Move Widget with this value in X direction.
it_it: Sposta il Widget con questo valore nella direzione X.

source: Move Widget with this value in Y direction.
it_it: Sposta il Widget con questo valore nella direzione Y.

source: Move down 1 layer.
it_it: Sposta giù di 1 livello.

source: Move object around the centre of the parent object (e.g. around the circumference of a scale)
it_it: Sposta l'oggetto attorno al centro dell'oggetto padre (ad esempio attorno alla circonferenza di una scala)

source: Move start point of object (e.g. scale tick) radially
it_it: Sposta il punto iniziale dell'oggetto (ad esempio, il segno di ridimensionamento) radialmente.

source: Move up 1 layer.
it_it: Sposta su di 1 livello.

source: Moving the cursor
it_it: Spostamento del cursore

source: Multi-Model Support
it_it: Supporto Multi-Modello

source: Multi-display support, even with mixed color formats
it_it: Supporto multi-display, anche con formati di colore misti

source: Multi-language support with UTF-8 encoding
it_it: Supporto multilingua con codifica UTF-8

source: Multi-touch Gestures
it_it: Gesti Multi-touch

source: Multi-touch can refer to two things:
it_it: Il termine multi-touch può riferirsi a due cose:

source: Multicast streaming for efficient network distribution
it_it: Streaming multicast per una distribuzione di rete efficiente

source: Multiple Groups
it_it: Gruppi Multipli

source: Multiple Instances of LVGL
it_it: Istanze Multiple di LVGL

source: Multiple XML sources can be registered; they will be merged and searched collectively.
it_it: È possibile registrare più sorgenti XML; queste verranno unite e ricercate collettivamente.

source: Multiple ``globals.xml`` files can be loaded if needed, but each will be saved in the same global scope, meaning duplicated items will be added only once.
it_it: È possibile caricare più file ``globals.xml``, ma ognuno verrà salvato nello stesso "scope" globale, il che significa che gli elementi duplicati verranno aggiunti una sola volta.

source: Multiple camera switching for different scene perspectives
it_it: Commutazione di più telecamere per diverse prospettive di scena

source: Multiple draw tasks can be queued and flushed them once to the GPU based on the GPU idle status.
it_it: È possibile mettere in coda più task di disegno e scaricarle una volta sulla GPU in base allo stato di inattività della GPU.

source: Multiple groups can also be created.
it_it: È anche possibile creare più gruppi.

source: Multiple repositories are available to help you get started easily.
it_it: Sono disponibili diversi repository per aiutare a iniziare facilmente.

source: Music, and
it_it: Music, e

source: Must be ``>= 1``.
it_it: Deve essere ``>= 1``.

source: Must be defined in the ``target``'s XML file.
it_it: Deve essere definito nel file XML del ``target``.

source: My display driver is not called.
it_it: Il driver video non viene chiamato.

source: NOTE: VG-Lite rendering backend does not support multi-threaded calls, please make sure :c:macro:`LV_USE_OS` is always configured as :c:macro:`LV_OS_NONE`.
it_it: NOTA: Il backend di rendering VG-Lite non supporta chiamate multi-thread, assicurarsi che :c:macro:`LV_USE_OS` sia sempre configurato come :c:macro:`LV_OS_NONE`.

source: NOTE: the path to the Editor executable is stored in the workspace folder in a file named `"lvgl_pro_editor_path.txt"`.
it_it: NOTA: il path all'eseguibile dell'Editor è memorizzato nella cartella dell'area di lavoro in un file denominato `"lvgl_pro_editor_path.txt"`.

source: NULL may be passed for this argument if there is no need to use that data when the event is processed.
it_it: È possibile passare NULL per questo argomento se non è necessario utilizzare tali dati durante l'elaborazione dell'evento.

source: NULL to disable.
it_it: NULL per disabilitare.

source: NV3007 LCD Controller Driver
it_it: Driver del controller LCD NV3007

source: NXP has integrated LVGL into the MCUXpresso SDK packages for several of our microcontrollers as an optional software component, allowing easy evaluation and migration into your product design.
it_it: NXP ha integrato LVGL nei pacchetti "SDK MCUXpresso" per diversi dei microcontrollori come componente software opzionale, consentendo una facile valutazione e migrazione nella progettazione del prodotto.

source: Name-based types
it_it: Tipi basati sui nomi

source: Namely:
it_it: Ovvero:

source: Names
it_it: Nomi

source: Names of days
it_it: Nomi dei giorni

source: Naming Conventions
it_it: Convenzioni sui Nomi

source: Navigate back to the root of the project and clone the repository:
it_it: Tornare alla radice del progetto e clonare il repository:

source: Navigate to ``Component config`` and then ``LVGL configuration``.
it_it: Accedere a ``Component config`` e poi a ``LVGL configuration``.

source: Navigate to `https://github.com/lvgl/lvgl <https://github.com/lvgl/lvgl>`__.
it_it: Andare su `https://github.com/lvgl/lvgl <https://github.com/lvgl/lvgl>`__.

source: Navigate to https://pro.lvgl.io/#download and press the [Download] button and save the resulting image to your workstation.
it_it: Accedere a https://pro.lvgl.io/#download, premere il pulsante [Download] e salvare l'immagine risultante sulla propria workstation.

source: Navigate to the file you want to edit.
it_it: Accedere al file da modificare.

source: Navigating to a new tab
it_it: Passare a una nuova scheda

source: Needs to be >= 1.
it_it: Deve essere >= 1.

source: NemaVG --- an extension to NeoChrom's base support --- is implemented by this MCU.
it_it: NemaVG, un'estensione del supporto base di NeoChrom, è implementato da questa MCU.

source: NeoChrom and DMA2D may be enabled at the same time.
it_it: NeoChrom e DMA2D possono essere abilitati contemporaneamente.

source: NeoChrom can be enabled at the same time as LTDC.
it_it: NeoChrom può essere abilitato contemporaneamente a LTDC.

source: NeoChrom requires a simple HAL implementation to allocate memory and optionally lock resources.
it_it: NeoChrom richiede una semplice implementazione HAL per allocare memoria e, facoltativamente, bloccare le risorse.

source: Neon Acceleration
it_it: Accelerazione Neon

source: Nested grid navigations
it_it: Grid navigation nidificate

source: Nested scrolling
it_it: Scrolling nidificato

source: Network streaming with HTTP/HTTPS support
it_it: Streaming di rete con supporto HTTP/HTTPS

source: New Button Matrix Widgets are added to the default group (if one is set).
it_it: I nuovi Widget Button Matrix vengono aggiunti al gruppo di default (se impostato).

source: New Features
it_it: Nuove Funzionalità

source: New Keymap
it_it: Nuova Mappa dei Pulsanti

source: New Widget
it_it: Nuovo Widget

source: New devices will automatically be added when they are connected.
it_it: I nuovi dispositivi verranno aggiunti automaticamente quando vengono connessi.

source: New rows and columns are automatically added as required.
it_it: Nuove righe e colonne vengono aggiunte automaticamente in base alle esigenze.

source: New tabs can be added with :cpp:expr:`lv_tabview_add_tab(tabview, "Tab name")`.
it_it: È possibile aggiungere nuove schede con :cpp:expr:`lv_tabview_add_tab(tabview, "Tab name")`.
